RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_uart.h
/* Bit fields for UART TRIGCTRL */
#define _UART_TRIGCTRL_RESETVALUE              0x00000000UL                            /**< Default value for UART_TRIGCTRL */
#define _UART_TRIGCTRL_MASK                    0x000F1FF0UL                            /**< Mask for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXTEN                    (0x1UL << 4)                            /**< Receive Trigger Enable */
#define _UART_TRIGCTRL_RXTEN_SHIFT             4                                       /**< Shift value for USART_RXTEN */
#define _UART_TRIGCTRL_RXTEN_MASK              0x10UL                                  /**< Bit mask for USART_RXTEN */
#define _UART_TRIGCTRL_RXTEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXTEN_DEFAULT            (_UART_TRIGCTRL_RXTEN_DEFAULT << 4)     /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXTEN                    (0x1UL << 5)                            /**< Transmit Trigger Enable */
#define _UART_TRIGCTRL_TXTEN_SHIFT             5                                       /**< Shift value for USART_TXTEN */
#define _UART_TRIGCTRL_TXTEN_MASK              0x20UL                                  /**< Bit mask for USART_TXTEN */
#define _UART_TRIGCTRL_TXTEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXTEN_DEFAULT            (_UART_TRIGCTRL_TXTEN_DEFAULT << 5)     /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_AUTOTXTEN                (0x1UL << 6)                            /**< AUTOTX Trigger Enable */
#define _UART_TRIGCTRL_AUTOTXTEN_SHIFT         6                                       /**< Shift value for USART_AUTOTXTEN */
#define _UART_TRIGCTRL_AUTOTXTEN_MASK          0x40UL                                  /**< Bit mask for USART_AUTOTXTEN */
#define _UART_TRIGCTRL_AUTOTXTEN_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_AUTOTXTEN_DEFAULT        (_UART_TRIGCTRL_AUTOTXTEN_DEFAULT << 6) /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXARX0EN                 (0x1UL << 7)                            /**< Enable Transmit Trigger After RX End of Frame Plus TCMP0VAL */
#define _UART_TRIGCTRL_TXARX0EN_SHIFT          7                                       /**< Shift value for USART_TXARX0EN */
#define _UART_TRIGCTRL_TXARX0EN_MASK           0x80UL                                  /**< Bit mask for USART_TXARX0EN */
#define _UART_TRIGCTRL_TXARX0EN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXARX0EN_DEFAULT         (_UART_TRIGCTRL_TXARX0EN_DEFAULT << 7)  /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXARX1EN                 (0x1UL << 8)                            /**< Enable Transmit Trigger After RX End of Frame Plus TCMP1VAL */
#define _UART_TRIGCTRL_TXARX1EN_SHIFT          8                                       /**< Shift value for USART_TXARX1EN */
#define _UART_TRIGCTRL_TXARX1EN_MASK           0x100UL                                 /**< Bit mask for USART_TXARX1EN */
#define _UART_TRIGCTRL_TXARX1EN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXARX1EN_DEFAULT         (_UART_TRIGCTRL_TXARX1EN_DEFAULT << 8)  /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXARX2EN                 (0x1UL << 9)                            /**< Enable Transmit Trigger After RX End of Frame Plus TCMP2VAL */
#define _UART_TRIGCTRL_TXARX2EN_SHIFT          9                                       /**< Shift value for USART_TXARX2EN */
#define _UART_TRIGCTRL_TXARX2EN_MASK           0x200UL                                 /**< Bit mask for USART_TXARX2EN */
#define _UART_TRIGCTRL_TXARX2EN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TXARX2EN_DEFAULT         (_UART_TRIGCTRL_TXARX2EN_DEFAULT << 9)  /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXATX0EN                 (0x1UL << 10)                           /**< Enable Receive Trigger After TX End of Frame Plus TCMPVAL0 Baud-times */
#define _UART_TRIGCTRL_RXATX0EN_SHIFT          10                                      /**< Shift value for USART_RXATX0EN */
#define _UART_TRIGCTRL_RXATX0EN_MASK           0x400UL                                 /**< Bit mask for USART_RXATX0EN */
#define _UART_TRIGCTRL_RXATX0EN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXATX0EN_DEFAULT         (_UART_TRIGCTRL_RXATX0EN_DEFAULT << 10) /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXATX1EN                 (0x1UL << 11)                           /**< Enable Receive Trigger After TX End of Frame Plus TCMPVAL1 Baud-times */
#define _UART_TRIGCTRL_RXATX1EN_SHIFT          11                                      /**< Shift value for USART_RXATX1EN */
#define _UART_TRIGCTRL_RXATX1EN_MASK           0x800UL                                 /**< Bit mask for USART_RXATX1EN */
#define _UART_TRIGCTRL_RXATX1EN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXATX1EN_DEFAULT         (_UART_TRIGCTRL_RXATX1EN_DEFAULT << 11) /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXATX2EN                 (0x1UL << 12)                           /**< Enable Receive Trigger After TX End of Frame Plus TCMPVAL2 Baud-times */
#define _UART_TRIGCTRL_RXATX2EN_SHIFT          12                                      /**< Shift value for USART_RXATX2EN */
#define _UART_TRIGCTRL_RXATX2EN_MASK           0x1000UL                                /**< Bit mask for USART_RXATX2EN */
#define _UART_TRIGCTRL_RXATX2EN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_RXATX2EN_DEFAULT         (_UART_TRIGCTRL_RXATX2EN_DEFAULT << 12) /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_SHIFT              16                                      /**< Shift value for USART_TSEL */
#define _UART_TRIGCTRL_TSEL_MASK               0xF0000UL                               /**< Bit mask for USART_TSEL */
#define _UART_TRIGCTRL_TSEL_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH0             0x00000000UL                            /**< Mode PRSCH0 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH1             0x00000001UL                            /**< Mode PRSCH1 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH2             0x00000002UL                            /**< Mode PRSCH2 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH3             0x00000003UL                            /**< Mode PRSCH3 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH4             0x00000004UL                            /**< Mode PRSCH4 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH5             0x00000005UL                            /**< Mode PRSCH5 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH6             0x00000006UL                            /**< Mode PRSCH6 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH7             0x00000007UL                            /**< Mode PRSCH7 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH8             0x00000008UL                            /**< Mode PRSCH8 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH9             0x00000009UL                            /**< Mode PRSCH9 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH10            0x0000000AUL                            /**< Mode PRSCH10 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH11            0x0000000BUL                            /**< Mode PRSCH11 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH12            0x0000000CUL                            /**< Mode PRSCH12 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH13            0x0000000DUL                            /**< Mode PRSCH13 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH14            0x0000000EUL                            /**< Mode PRSCH14 for UART_TRIGCTRL */
#define _UART_TRIGCTRL_TSEL_PRSCH15            0x0000000FUL                            /**< Mode PRSCH15 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_DEFAULT             (_UART_TRIGCTRL_TSEL_DEFAULT << 16)     /**< Shifted mode DEFAULT for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH0              (_UART_TRIGCTRL_TSEL_PRSCH0 << 16)      /**< Shifted mode PRSCH0 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH1              (_UART_TRIGCTRL_TSEL_PRSCH1 << 16)      /**< Shifted mode PRSCH1 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH2              (_UART_TRIGCTRL_TSEL_PRSCH2 << 16)      /**< Shifted mode PRSCH2 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH3              (_UART_TRIGCTRL_TSEL_PRSCH3 << 16)      /**< Shifted mode PRSCH3 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH4              (_UART_TRIGCTRL_TSEL_PRSCH4 << 16)      /**< Shifted mode PRSCH4 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH5              (_UART_TRIGCTRL_TSEL_PRSCH5 << 16)      /**< Shifted mode PRSCH5 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH6              (_UART_TRIGCTRL_TSEL_PRSCH6 << 16)      /**< Shifted mode PRSCH6 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH7              (_UART_TRIGCTRL_TSEL_PRSCH7 << 16)      /**< Shifted mode PRSCH7 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH8              (_UART_TRIGCTRL_TSEL_PRSCH8 << 16)      /**< Shifted mode PRSCH8 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH9              (_UART_TRIGCTRL_TSEL_PRSCH9 << 16)      /**< Shifted mode PRSCH9 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH10             (_UART_TRIGCTRL_TSEL_PRSCH10 << 16)     /**< Shifted mode PRSCH10 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH11             (_UART_TRIGCTRL_TSEL_PRSCH11 << 16)     /**< Shifted mode PRSCH11 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH12             (_UART_TRIGCTRL_TSEL_PRSCH12 << 16)     /**< Shifted mode PRSCH12 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH13             (_UART_TRIGCTRL_TSEL_PRSCH13 << 16)     /**< Shifted mode PRSCH13 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH14             (_UART_TRIGCTRL_TSEL_PRSCH14 << 16)     /**< Shifted mode PRSCH14 for UART_TRIGCTRL */
#define UART_TRIGCTRL_TSEL_PRSCH15             (_UART_TRIGCTRL_TSEL_PRSCH15 << 16)     /**< Shifted mode PRSCH15 for UART_TRIGCTRL */

/* Bit fields for UART CMD */
#define _UART_CMD_RESETVALUE                   0x00000000UL                        /**< Default value for UART_CMD */
#define _UART_CMD_MASK                         0x00000FFFUL                        /**< Mask for UART_CMD */
#define UART_CMD_RXEN                          (0x1UL << 0)                        /**< Receiver Enable */
#define _UART_CMD_RXEN_SHIFT                   0                                   /**< Shift value for USART_RXEN */
#define _UART_CMD_RXEN_MASK                    0x1UL                               /**< Bit mask for USART_RXEN */
#define _UART_CMD_RXEN_DEFAULT                 0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_RXEN_DEFAULT                  (_UART_CMD_RXEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_RXDIS                         (0x1UL << 1)                        /**< Receiver Disable */
#define _UART_CMD_RXDIS_SHIFT                  1                                   /**< Shift value for USART_RXDIS */
#define _UART_CMD_RXDIS_MASK                   0x2UL                               /**< Bit mask for USART_RXDIS */
#define _UART_CMD_RXDIS_DEFAULT                0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_RXDIS_DEFAULT                 (_UART_CMD_RXDIS_DEFAULT << 1)      /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_TXEN                          (0x1UL << 2)                        /**< Transmitter Enable */
#define _UART_CMD_TXEN_SHIFT                   2                                   /**< Shift value for USART_TXEN */
#define _UART_CMD_TXEN_MASK                    0x4UL                               /**< Bit mask for USART_TXEN */
#define _UART_CMD_TXEN_DEFAULT                 0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_TXEN_DEFAULT                  (_UART_CMD_TXEN_DEFAULT << 2)       /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_TXDIS                         (0x1UL << 3)                        /**< Transmitter Disable */
#define _UART_CMD_TXDIS_SHIFT                  3                                   /**< Shift value for USART_TXDIS */
#define _UART_CMD_TXDIS_MASK                   0x8UL                               /**< Bit mask for USART_TXDIS */
#define _UART_CMD_TXDIS_DEFAULT                0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_TXDIS_DEFAULT                 (_UART_CMD_TXDIS_DEFAULT << 3)      /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_MASTEREN                      (0x1UL << 4)                        /**< Master Enable */
#define _UART_CMD_MASTEREN_SHIFT               4                                   /**< Shift value for USART_MASTEREN */
#define _UART_CMD_MASTEREN_MASK                0x10UL                              /**< Bit mask for USART_MASTEREN */
#define _UART_CMD_MASTEREN_DEFAULT             0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_MASTEREN_DEFAULT              (_UART_CMD_MASTEREN_DEFAULT << 4)   /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_MASTERDIS                     (0x1UL << 5)                        /**< Master Disable */
#define _UART_CMD_MASTERDIS_SHIFT              5                                   /**< Shift value for USART_MASTERDIS */
#define _UART_CMD_MASTERDIS_MASK               0x20UL                              /**< Bit mask for USART_MASTERDIS */
#define _UART_CMD_MASTERDIS_DEFAULT            0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_MASTERDIS_DEFAULT             (_UART_CMD_MASTERDIS_DEFAULT << 5)  /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_RXBLOCKEN                     (0x1UL << 6)                        /**< Receiver Block Enable */
#define _UART_CMD_RXBLOCKEN_SHIFT              6                                   /**< Shift value for USART_RXBLOCKEN */
#define _UART_CMD_RXBLOCKEN_MASK               0x40UL                              /**< Bit mask for USART_RXBLOCKEN */
#define _UART_CMD_RXBLOCKEN_DEFAULT            0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_RXBLOCKEN_DEFAULT             (_UART_CMD_RXBLOCKEN_DEFAULT << 6)  /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_RXBLOCKDIS                    (0x1UL << 7)                        /**< Receiver Block Disable */
#define _UART_CMD_RXBLOCKDIS_SHIFT             7                                   /**< Shift value for USART_RXBLOCKDIS */
#define _UART_CMD_RXBLOCKDIS_MASK              0x80UL                              /**< Bit mask for USART_RXBLOCKDIS */
#define _UART_CMD_RXBLOCKDIS_DEFAULT           0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_RXBLOCKDIS_DEFAULT            (_UART_CMD_RXBLOCKDIS_DEFAULT << 7) /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_TXTRIEN                       (0x1UL << 8)                        /**< Transmitter Tristate Enable */
#define _UART_CMD_TXTRIEN_SHIFT                8                                   /**< Shift value for USART_TXTRIEN */
#define _UART_CMD_TXTRIEN_MASK                 0x100UL                             /**< Bit mask for USART_TXTRIEN */
#define _UART_CMD_TXTRIEN_DEFAULT              0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_TXTRIEN_DEFAULT               (_UART_CMD_TXTRIEN_DEFAULT << 8)    /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_TXTRIDIS                      (0x1UL << 9)                        /**< Transmitter Tristate Disable */
#define _UART_CMD_TXTRIDIS_SHIFT               9                                   /**< Shift value for USART_TXTRIDIS */
#define _UART_CMD_TXTRIDIS_MASK                0x200UL                             /**< Bit mask for USART_TXTRIDIS */
#define _UART_CMD_TXTRIDIS_DEFAULT             0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_TXTRIDIS_DEFAULT              (_UART_CMD_TXTRIDIS_DEFAULT << 9)   /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_CLEARTX                       (0x1UL << 10)                       /**< Clear TX */
#define _UART_CMD_CLEARTX_SHIFT                10                                  /**< Shift value for USART_CLEARTX */
#define _UART_CMD_CLEARTX_MASK                 0x400UL                             /**< Bit mask for USART_CLEARTX */
#define _UART_CMD_CLEARTX_DEFAULT              0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_CLEARTX_DEFAULT               (_UART_CMD_CLEARTX_DEFAULT << 10)   /**< Shifted mode DEFAULT for UART_CMD */
#define UART_CMD_CLEARRX                       (0x1UL << 11)                       /**< Clear RX */
#define _UART_CMD_CLEARRX_SHIFT                11                                  /**< Shift value for USART_CLEARRX */
#define _UART_CMD_CLEARRX_MASK                 0x800UL                             /**< Bit mask for USART_CLEARRX */
#define _UART_CMD_CLEARRX_DEFAULT              0x00000000UL                        /**< Mode DEFAULT for UART_CMD */
#define UART_CMD_CLEARRX_DEFAULT               (_UART_CMD_CLEARRX_DEFAULT << 11)   /**< Shifted mode DEFAULT for UART_CMD */

