RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_uart.h
/* Bit fields for UART INPUT */
#define _UART_INPUT_RESETVALUE                 0x00000000UL                         /**< Default value for UART_INPUT */
#define _UART_INPUT_MASK                       0x00008F8FUL                         /**< Mask for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_SHIFT             0                                    /**< Shift value for USART_RXPRSSEL */
#define _UART_INPUT_RXPRSSEL_MASK              0xFUL                                /**< Bit mask for USART_RXPRSSEL */
#define _UART_INPUT_RXPRSSEL_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH0            0x00000000UL                         /**< Mode PRSCH0 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH1            0x00000001UL                         /**< Mode PRSCH1 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH2            0x00000002UL                         /**< Mode PRSCH2 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH3            0x00000003UL                         /**< Mode PRSCH3 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH4            0x00000004UL                         /**< Mode PRSCH4 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH5            0x00000005UL                         /**< Mode PRSCH5 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH6            0x00000006UL                         /**< Mode PRSCH6 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH7            0x00000007UL                         /**< Mode PRSCH7 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH8            0x00000008UL                         /**< Mode PRSCH8 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH9            0x00000009UL                         /**< Mode PRSCH9 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH10           0x0000000AUL                         /**< Mode PRSCH10 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH11           0x0000000BUL                         /**< Mode PRSCH11 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH12           0x0000000CUL                         /**< Mode PRSCH12 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH13           0x0000000DUL                         /**< Mode PRSCH13 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH14           0x0000000EUL                         /**< Mode PRSCH14 for UART_INPUT */
#define _UART_INPUT_RXPRSSEL_PRSCH15           0x0000000FUL                         /**< Mode PRSCH15 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_DEFAULT            (_UART_INPUT_RXPRSSEL_DEFAULT << 0)  /**< Shifted mode DEFAULT for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH0             (_UART_INPUT_RXPRSSEL_PRSCH0 << 0)   /**< Shifted mode PRSCH0 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH1             (_UART_INPUT_RXPRSSEL_PRSCH1 << 0)   /**< Shifted mode PRSCH1 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH2             (_UART_INPUT_RXPRSSEL_PRSCH2 << 0)   /**< Shifted mode PRSCH2 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH3             (_UART_INPUT_RXPRSSEL_PRSCH3 << 0)   /**< Shifted mode PRSCH3 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH4             (_UART_INPUT_RXPRSSEL_PRSCH4 << 0)   /**< Shifted mode PRSCH4 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH5             (_UART_INPUT_RXPRSSEL_PRSCH5 << 0)   /**< Shifted mode PRSCH5 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH6             (_UART_INPUT_RXPRSSEL_PRSCH6 << 0)   /**< Shifted mode PRSCH6 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH7             (_UART_INPUT_RXPRSSEL_PRSCH7 << 0)   /**< Shifted mode PRSCH7 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH8             (_UART_INPUT_RXPRSSEL_PRSCH8 << 0)   /**< Shifted mode PRSCH8 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH9             (_UART_INPUT_RXPRSSEL_PRSCH9 << 0)   /**< Shifted mode PRSCH9 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH10            (_UART_INPUT_RXPRSSEL_PRSCH10 << 0)  /**< Shifted mode PRSCH10 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH11            (_UART_INPUT_RXPRSSEL_PRSCH11 << 0)  /**< Shifted mode PRSCH11 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH12            (_UART_INPUT_RXPRSSEL_PRSCH12 << 0)  /**< Shifted mode PRSCH12 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH13            (_UART_INPUT_RXPRSSEL_PRSCH13 << 0)  /**< Shifted mode PRSCH13 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH14            (_UART_INPUT_RXPRSSEL_PRSCH14 << 0)  /**< Shifted mode PRSCH14 for UART_INPUT */
#define UART_INPUT_RXPRSSEL_PRSCH15            (_UART_INPUT_RXPRSSEL_PRSCH15 << 0)  /**< Shifted mode PRSCH15 for UART_INPUT */
#define UART_INPUT_RXPRS                       (0x1UL << 7)                         /**< PRS RX Enable */
#define _UART_INPUT_RXPRS_SHIFT                7                                    /**< Shift value for USART_RXPRS */
#define _UART_INPUT_RXPRS_MASK                 0x80UL                               /**< Bit mask for USART_RXPRS */
#define _UART_INPUT_RXPRS_DEFAULT              0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define UART_INPUT_RXPRS_DEFAULT               (_UART_INPUT_RXPRS_DEFAULT << 7)     /**< Shifted mode DEFAULT for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_SHIFT            8                                    /**< Shift value for USART_CLKPRSSEL */
#define _UART_INPUT_CLKPRSSEL_MASK             0xF00UL                              /**< Bit mask for USART_CLKPRSSEL */
#define _UART_INPUT_CLKPRSSEL_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH0           0x00000000UL                         /**< Mode PRSCH0 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH1           0x00000001UL                         /**< Mode PRSCH1 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH2           0x00000002UL                         /**< Mode PRSCH2 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH3           0x00000003UL                         /**< Mode PRSCH3 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH4           0x00000004UL                         /**< Mode PRSCH4 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH5           0x00000005UL                         /**< Mode PRSCH5 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH6           0x00000006UL                         /**< Mode PRSCH6 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH7           0x00000007UL                         /**< Mode PRSCH7 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH8           0x00000008UL                         /**< Mode PRSCH8 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH9           0x00000009UL                         /**< Mode PRSCH9 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH10          0x0000000AUL                         /**< Mode PRSCH10 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH11          0x0000000BUL                         /**< Mode PRSCH11 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH12          0x0000000CUL                         /**< Mode PRSCH12 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH13          0x0000000DUL                         /**< Mode PRSCH13 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH14          0x0000000EUL                         /**< Mode PRSCH14 for UART_INPUT */
#define _UART_INPUT_CLKPRSSEL_PRSCH15          0x0000000FUL                         /**< Mode PRSCH15 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_DEFAULT           (_UART_INPUT_CLKPRSSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH0            (_UART_INPUT_CLKPRSSEL_PRSCH0 << 8)  /**< Shifted mode PRSCH0 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH1            (_UART_INPUT_CLKPRSSEL_PRSCH1 << 8)  /**< Shifted mode PRSCH1 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH2            (_UART_INPUT_CLKPRSSEL_PRSCH2 << 8)  /**< Shifted mode PRSCH2 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH3            (_UART_INPUT_CLKPRSSEL_PRSCH3 << 8)  /**< Shifted mode PRSCH3 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH4            (_UART_INPUT_CLKPRSSEL_PRSCH4 << 8)  /**< Shifted mode PRSCH4 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH5            (_UART_INPUT_CLKPRSSEL_PRSCH5 << 8)  /**< Shifted mode PRSCH5 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH6            (_UART_INPUT_CLKPRSSEL_PRSCH6 << 8)  /**< Shifted mode PRSCH6 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH7            (_UART_INPUT_CLKPRSSEL_PRSCH7 << 8)  /**< Shifted mode PRSCH7 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH8            (_UART_INPUT_CLKPRSSEL_PRSCH8 << 8)  /**< Shifted mode PRSCH8 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH9            (_UART_INPUT_CLKPRSSEL_PRSCH9 << 8)  /**< Shifted mode PRSCH9 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH10           (_UART_INPUT_CLKPRSSEL_PRSCH10 << 8) /**< Shifted mode PRSCH10 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH11           (_UART_INPUT_CLKPRSSEL_PRSCH11 << 8) /**< Shifted mode PRSCH11 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH12           (_UART_INPUT_CLKPRSSEL_PRSCH12 << 8) /**< Shifted mode PRSCH12 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH13           (_UART_INPUT_CLKPRSSEL_PRSCH13 << 8) /**< Shifted mode PRSCH13 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH14           (_UART_INPUT_CLKPRSSEL_PRSCH14 << 8) /**< Shifted mode PRSCH14 for UART_INPUT */
#define UART_INPUT_CLKPRSSEL_PRSCH15           (_UART_INPUT_CLKPRSSEL_PRSCH15 << 8) /**< Shifted mode PRSCH15 for UART_INPUT */
#define UART_INPUT_CLKPRS                      (0x1UL << 15)                        /**< PRS CLK Enable */
#define _UART_INPUT_CLKPRS_SHIFT               15                                   /**< Shift value for USART_CLKPRS */
#define _UART_INPUT_CLKPRS_MASK                0x8000UL                             /**< Bit mask for USART_CLKPRS */
#define _UART_INPUT_CLKPRS_DEFAULT             0x00000000UL                         /**< Mode DEFAULT for UART_INPUT */
#define UART_INPUT_CLKPRS_DEFAULT              (_UART_INPUT_CLKPRS_DEFAULT << 15)   /**< Shifted mode DEFAULT for UART_INPUT */

