RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_uart.h
/* Bit fields for UART I2SCTRL */
#define _UART_I2SCTRL_RESETVALUE               0x00000000UL                          /**< Default value for UART_I2SCTRL */
#define _UART_I2SCTRL_MASK                     0x0000071FUL                          /**< Mask for UART_I2SCTRL */
#define UART_I2SCTRL_EN                        (0x1UL << 0)                          /**< Enable I2S Mode */
#define _UART_I2SCTRL_EN_SHIFT                 0                                     /**< Shift value for USART_EN */
#define _UART_I2SCTRL_EN_MASK                  0x1UL                                 /**< Bit mask for USART_EN */
#define _UART_I2SCTRL_EN_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_EN_DEFAULT                (_UART_I2SCTRL_EN_DEFAULT << 0)       /**< Shifted mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_MONO                      (0x1UL << 1)                          /**< Stero or Mono */
#define _UART_I2SCTRL_MONO_SHIFT               1                                     /**< Shift value for USART_MONO */
#define _UART_I2SCTRL_MONO_MASK                0x2UL                                 /**< Bit mask for USART_MONO */
#define _UART_I2SCTRL_MONO_DEFAULT             0x00000000UL                          /**< Mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_MONO_DEFAULT              (_UART_I2SCTRL_MONO_DEFAULT << 1)     /**< Shifted mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_JUSTIFY                   (0x1UL << 2)                          /**< Justification of I2S Data */
#define _UART_I2SCTRL_JUSTIFY_SHIFT            2                                     /**< Shift value for USART_JUSTIFY */
#define _UART_I2SCTRL_JUSTIFY_MASK             0x4UL                                 /**< Bit mask for USART_JUSTIFY */
#define _UART_I2SCTRL_JUSTIFY_DEFAULT          0x00000000UL                          /**< Mode DEFAULT for UART_I2SCTRL */
#define _UART_I2SCTRL_JUSTIFY_LEFT             0x00000000UL                          /**< Mode LEFT for UART_I2SCTRL */
#define _UART_I2SCTRL_JUSTIFY_RIGHT            0x00000001UL                          /**< Mode RIGHT for UART_I2SCTRL */
#define UART_I2SCTRL_JUSTIFY_DEFAULT           (_UART_I2SCTRL_JUSTIFY_DEFAULT << 2)  /**< Shifted mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_JUSTIFY_LEFT              (_UART_I2SCTRL_JUSTIFY_LEFT << 2)     /**< Shifted mode LEFT for UART_I2SCTRL */
#define UART_I2SCTRL_JUSTIFY_RIGHT             (_UART_I2SCTRL_JUSTIFY_RIGHT << 2)    /**< Shifted mode RIGHT for UART_I2SCTRL */
#define UART_I2SCTRL_DMASPLIT                  (0x1UL << 3)                          /**< Separate DMA Request for Left/Right Data */
#define _UART_I2SCTRL_DMASPLIT_SHIFT           3                                     /**< Shift value for USART_DMASPLIT */
#define _UART_I2SCTRL_DMASPLIT_MASK            0x8UL                                 /**< Bit mask for USART_DMASPLIT */
#define _UART_I2SCTRL_DMASPLIT_DEFAULT         0x00000000UL                          /**< Mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_DMASPLIT_DEFAULT          (_UART_I2SCTRL_DMASPLIT_DEFAULT << 3) /**< Shifted mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_DELAY                     (0x1UL << 4)                          /**< Delay on I2S Data */
#define _UART_I2SCTRL_DELAY_SHIFT              4                                     /**< Shift value for USART_DELAY */
#define _UART_I2SCTRL_DELAY_MASK               0x10UL                                /**< Bit mask for USART_DELAY */
#define _UART_I2SCTRL_DELAY_DEFAULT            0x00000000UL                          /**< Mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_DELAY_DEFAULT             (_UART_I2SCTRL_DELAY_DEFAULT << 4)    /**< Shifted mode DEFAULT for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_SHIFT             8                                     /**< Shift value for USART_FORMAT */
#define _UART_I2SCTRL_FORMAT_MASK              0x700UL                               /**< Bit mask for USART_FORMAT */
#define _UART_I2SCTRL_FORMAT_DEFAULT           0x00000000UL                          /**< Mode DEFAULT for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W32D32            0x00000000UL                          /**< Mode W32D32 for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W32D24M           0x00000001UL                          /**< Mode W32D24M for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W32D24            0x00000002UL                          /**< Mode W32D24 for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W32D16            0x00000003UL                          /**< Mode W32D16 for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W32D8             0x00000004UL                          /**< Mode W32D8 for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W16D16            0x00000005UL                          /**< Mode W16D16 for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W16D8             0x00000006UL                          /**< Mode W16D8 for UART_I2SCTRL */
#define _UART_I2SCTRL_FORMAT_W8D8              0x00000007UL                          /**< Mode W8D8 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_DEFAULT            (_UART_I2SCTRL_FORMAT_DEFAULT << 8)   /**< Shifted mode DEFAULT for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W32D32             (_UART_I2SCTRL_FORMAT_W32D32 << 8)    /**< Shifted mode W32D32 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W32D24M            (_UART_I2SCTRL_FORMAT_W32D24M << 8)   /**< Shifted mode W32D24M for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W32D24             (_UART_I2SCTRL_FORMAT_W32D24 << 8)    /**< Shifted mode W32D24 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W32D16             (_UART_I2SCTRL_FORMAT_W32D16 << 8)    /**< Shifted mode W32D16 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W32D8              (_UART_I2SCTRL_FORMAT_W32D8 << 8)     /**< Shifted mode W32D8 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W16D16             (_UART_I2SCTRL_FORMAT_W16D16 << 8)    /**< Shifted mode W16D16 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W16D8              (_UART_I2SCTRL_FORMAT_W16D8 << 8)     /**< Shifted mode W16D8 for UART_I2SCTRL */
#define UART_I2SCTRL_FORMAT_W8D8               (_UART_I2SCTRL_FORMAT_W8D8 << 8)      /**< Shifted mode W8D8 for UART_I2SCTRL */

/* Bit fields for UART TIMING */
#define _UART_TIMING_RESETVALUE                0x00000000UL                         /**< Default value for UART_TIMING */
#define _UART_TIMING_MASK                      0x77770000UL                         /**< Mask for UART_TIMING */
#define _UART_TIMING_TXDELAY_SHIFT             16                                   /**< Shift value for USART_TXDELAY */
#define _UART_TIMING_TXDELAY_MASK              0x70000UL                            /**< Bit mask for USART_TXDELAY */
#define _UART_TIMING_TXDELAY_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_TIMING */
#define _UART_TIMING_TXDELAY_DISABLE           0x00000000UL                         /**< Mode DISABLE for UART_TIMING */
#define _UART_TIMING_TXDELAY_ONE               0x00000001UL                         /**< Mode ONE for UART_TIMING */
#define _UART_TIMING_TXDELAY_TWO               0x00000002UL                         /**< Mode TWO for UART_TIMING */
#define _UART_TIMING_TXDELAY_THREE             0x00000003UL                         /**< Mode THREE for UART_TIMING */
#define _UART_TIMING_TXDELAY_SEVEN             0x00000004UL                         /**< Mode SEVEN for UART_TIMING */
#define _UART_TIMING_TXDELAY_TCMP0             0x00000005UL                         /**< Mode TCMP0 for UART_TIMING */
#define _UART_TIMING_TXDELAY_TCMP1             0x00000006UL                         /**< Mode TCMP1 for UART_TIMING */
#define _UART_TIMING_TXDELAY_TCMP2             0x00000007UL                         /**< Mode TCMP2 for UART_TIMING */
#define UART_TIMING_TXDELAY_DEFAULT            (_UART_TIMING_TXDELAY_DEFAULT << 16) /**< Shifted mode DEFAULT for UART_TIMING */
#define UART_TIMING_TXDELAY_DISABLE            (_UART_TIMING_TXDELAY_DISABLE << 16) /**< Shifted mode DISABLE for UART_TIMING */
#define UART_TIMING_TXDELAY_ONE                (_UART_TIMING_TXDELAY_ONE << 16)     /**< Shifted mode ONE for UART_TIMING */
#define UART_TIMING_TXDELAY_TWO                (_UART_TIMING_TXDELAY_TWO << 16)     /**< Shifted mode TWO for UART_TIMING */
#define UART_TIMING_TXDELAY_THREE              (_UART_TIMING_TXDELAY_THREE << 16)   /**< Shifted mode THREE for UART_TIMING */
#define UART_TIMING_TXDELAY_SEVEN              (_UART_TIMING_TXDELAY_SEVEN << 16)   /**< Shifted mode SEVEN for UART_TIMING */
#define UART_TIMING_TXDELAY_TCMP0              (_UART_TIMING_TXDELAY_TCMP0 << 16)   /**< Shifted mode TCMP0 for UART_TIMING */
#define UART_TIMING_TXDELAY_TCMP1              (_UART_TIMING_TXDELAY_TCMP1 << 16)   /**< Shifted mode TCMP1 for UART_TIMING */
#define UART_TIMING_TXDELAY_TCMP2              (_UART_TIMING_TXDELAY_TCMP2 << 16)   /**< Shifted mode TCMP2 for UART_TIMING */
#define _UART_TIMING_CSSETUP_SHIFT             20                                   /**< Shift value for USART_CSSETUP */
#define _UART_TIMING_CSSETUP_MASK              0x700000UL                           /**< Bit mask for USART_CSSETUP */
#define _UART_TIMING_CSSETUP_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_TIMING */
#define _UART_TIMING_CSSETUP_ZERO              0x00000000UL                         /**< Mode ZERO for UART_TIMING */
#define _UART_TIMING_CSSETUP_ONE               0x00000001UL                         /**< Mode ONE for UART_TIMING */
#define _UART_TIMING_CSSETUP_TWO               0x00000002UL                         /**< Mode TWO for UART_TIMING */
#define _UART_TIMING_CSSETUP_THREE             0x00000003UL                         /**< Mode THREE for UART_TIMING */
#define _UART_TIMING_CSSETUP_SEVEN             0x00000004UL                         /**< Mode SEVEN for UART_TIMING */
#define _UART_TIMING_CSSETUP_TCMP0             0x00000005UL                         /**< Mode TCMP0 for UART_TIMING */
#define _UART_TIMING_CSSETUP_TCMP1             0x00000006UL                         /**< Mode TCMP1 for UART_TIMING */
#define _UART_TIMING_CSSETUP_TCMP2             0x00000007UL                         /**< Mode TCMP2 for UART_TIMING */
#define UART_TIMING_CSSETUP_DEFAULT            (_UART_TIMING_CSSETUP_DEFAULT << 20) /**< Shifted mode DEFAULT for UART_TIMING */
#define UART_TIMING_CSSETUP_ZERO               (_UART_TIMING_CSSETUP_ZERO << 20)    /**< Shifted mode ZERO for UART_TIMING */
#define UART_TIMING_CSSETUP_ONE                (_UART_TIMING_CSSETUP_ONE << 20)     /**< Shifted mode ONE for UART_TIMING */
#define UART_TIMING_CSSETUP_TWO                (_UART_TIMING_CSSETUP_TWO << 20)     /**< Shifted mode TWO for UART_TIMING */
#define UART_TIMING_CSSETUP_THREE              (_UART_TIMING_CSSETUP_THREE << 20)   /**< Shifted mode THREE for UART_TIMING */
#define UART_TIMING_CSSETUP_SEVEN              (_UART_TIMING_CSSETUP_SEVEN << 20)   /**< Shifted mode SEVEN for UART_TIMING */
#define UART_TIMING_CSSETUP_TCMP0              (_UART_TIMING_CSSETUP_TCMP0 << 20)   /**< Shifted mode TCMP0 for UART_TIMING */
#define UART_TIMING_CSSETUP_TCMP1              (_UART_TIMING_CSSETUP_TCMP1 << 20)   /**< Shifted mode TCMP1 for UART_TIMING */
#define UART_TIMING_CSSETUP_TCMP2              (_UART_TIMING_CSSETUP_TCMP2 << 20)   /**< Shifted mode TCMP2 for UART_TIMING */
#define _UART_TIMING_ICS_SHIFT                 24                                   /**< Shift value for USART_ICS */
#define _UART_TIMING_ICS_MASK                  0x7000000UL                          /**< Bit mask for USART_ICS */
#define _UART_TIMING_ICS_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for UART_TIMING */
#define _UART_TIMING_ICS_ZERO                  0x00000000UL                         /**< Mode ZERO for UART_TIMING */
#define _UART_TIMING_ICS_ONE                   0x00000001UL                         /**< Mode ONE for UART_TIMING */
#define _UART_TIMING_ICS_TWO                   0x00000002UL                         /**< Mode TWO for UART_TIMING */
#define _UART_TIMING_ICS_THREE                 0x00000003UL                         /**< Mode THREE for UART_TIMING */
#define _UART_TIMING_ICS_SEVEN                 0x00000004UL                         /**< Mode SEVEN for UART_TIMING */
#define _UART_TIMING_ICS_TCMP0                 0x00000005UL                         /**< Mode TCMP0 for UART_TIMING */
#define _UART_TIMING_ICS_TCMP1                 0x00000006UL                         /**< Mode TCMP1 for UART_TIMING */
#define _UART_TIMING_ICS_TCMP2                 0x00000007UL                         /**< Mode TCMP2 for UART_TIMING */
#define UART_TIMING_ICS_DEFAULT                (_UART_TIMING_ICS_DEFAULT << 24)     /**< Shifted mode DEFAULT for UART_TIMING */
#define UART_TIMING_ICS_ZERO                   (_UART_TIMING_ICS_ZERO << 24)        /**< Shifted mode ZERO for UART_TIMING */
#define UART_TIMING_ICS_ONE                    (_UART_TIMING_ICS_ONE << 24)         /**< Shifted mode ONE for UART_TIMING */
#define UART_TIMING_ICS_TWO                    (_UART_TIMING_ICS_TWO << 24)         /**< Shifted mode TWO for UART_TIMING */
#define UART_TIMING_ICS_THREE                  (_UART_TIMING_ICS_THREE << 24)       /**< Shifted mode THREE for UART_TIMING */
#define UART_TIMING_ICS_SEVEN                  (_UART_TIMING_ICS_SEVEN << 24)       /**< Shifted mode SEVEN for UART_TIMING */
#define UART_TIMING_ICS_TCMP0                  (_UART_TIMING_ICS_TCMP0 << 24)       /**< Shifted mode TCMP0 for UART_TIMING */
#define UART_TIMING_ICS_TCMP1                  (_UART_TIMING_ICS_TCMP1 << 24)       /**< Shifted mode TCMP1 for UART_TIMING */
#define UART_TIMING_ICS_TCMP2                  (_UART_TIMING_ICS_TCMP2 << 24)       /**< Shifted mode TCMP2 for UART_TIMING */
#define _UART_TIMING_CSHOLD_SHIFT              28                                   /**< Shift value for USART_CSHOLD */
#define _UART_TIMING_CSHOLD_MASK               0x70000000UL                         /**< Bit mask for USART_CSHOLD */
#define _UART_TIMING_CSHOLD_DEFAULT            0x00000000UL                         /**< Mode DEFAULT for UART_TIMING */
#define _UART_TIMING_CSHOLD_ZERO               0x00000000UL                         /**< Mode ZERO for UART_TIMING */
#define _UART_TIMING_CSHOLD_ONE                0x00000001UL                         /**< Mode ONE for UART_TIMING */
#define _UART_TIMING_CSHOLD_TWO                0x00000002UL                         /**< Mode TWO for UART_TIMING */
#define _UART_TIMING_CSHOLD_THREE              0x00000003UL                         /**< Mode THREE for UART_TIMING */
#define _UART_TIMING_CSHOLD_SEVEN              0x00000004UL                         /**< Mode SEVEN for UART_TIMING */
#define _UART_TIMING_CSHOLD_TCMP0              0x00000005UL                         /**< Mode TCMP0 for UART_TIMING */
#define _UART_TIMING_CSHOLD_TCMP1              0x00000006UL                         /**< Mode TCMP1 for UART_TIMING */
#define _UART_TIMING_CSHOLD_TCMP2              0x00000007UL                         /**< Mode TCMP2 for UART_TIMING */
#define UART_TIMING_CSHOLD_DEFAULT             (_UART_TIMING_CSHOLD_DEFAULT << 28)  /**< Shifted mode DEFAULT for UART_TIMING */
#define UART_TIMING_CSHOLD_ZERO                (_UART_TIMING_CSHOLD_ZERO << 28)     /**< Shifted mode ZERO for UART_TIMING */
#define UART_TIMING_CSHOLD_ONE                 (_UART_TIMING_CSHOLD_ONE << 28)      /**< Shifted mode ONE for UART_TIMING */
#define UART_TIMING_CSHOLD_TWO                 (_UART_TIMING_CSHOLD_TWO << 28)      /**< Shifted mode TWO for UART_TIMING */
#define UART_TIMING_CSHOLD_THREE               (_UART_TIMING_CSHOLD_THREE << 28)    /**< Shifted mode THREE for UART_TIMING */
#define UART_TIMING_CSHOLD_SEVEN               (_UART_TIMING_CSHOLD_SEVEN << 28)    /**< Shifted mode SEVEN for UART_TIMING */
#define UART_TIMING_CSHOLD_TCMP0               (_UART_TIMING_CSHOLD_TCMP0 << 28)    /**< Shifted mode TCMP0 for UART_TIMING */
#define UART_TIMING_CSHOLD_TCMP1               (_UART_TIMING_CSHOLD_TCMP1 << 28)    /**< Shifted mode TCMP1 for UART_TIMING */
#define UART_TIMING_CSHOLD_TCMP2               (_UART_TIMING_CSHOLD_TCMP2 << 28)    /**< Shifted mode TCMP2 for UART_TIMING */

/* Bit fields for UART CTRLX */
#define _UART_CTRLX_RESETVALUE                 0x00000000UL                       /**< Default value for UART_CTRLX */
#define _UART_CTRLX_MASK                       0x0000000FUL                       /**< Mask for UART_CTRLX */
#define UART_CTRLX_DBGHALT                     (0x1UL << 0)                       /**< Debug Halt */
#define _UART_CTRLX_DBGHALT_SHIFT              0                                  /**< Shift value for USART_DBGHALT */
#define _UART_CTRLX_DBGHALT_MASK               0x1UL                              /**< Bit mask for USART_DBGHALT */
#define _UART_CTRLX_DBGHALT_DEFAULT            0x00000000UL                       /**< Mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_DBGHALT_DEFAULT             (_UART_CTRLX_DBGHALT_DEFAULT << 0) /**< Shifted mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_CTSINV                      (0x1UL << 1)                       /**< CTS Pin Inversion */
#define _UART_CTRLX_CTSINV_SHIFT               1                                  /**< Shift value for USART_CTSINV */
#define _UART_CTRLX_CTSINV_MASK                0x2UL                              /**< Bit mask for USART_CTSINV */
#define _UART_CTRLX_CTSINV_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_CTSINV_DEFAULT              (_UART_CTRLX_CTSINV_DEFAULT << 1)  /**< Shifted mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_CTSEN                       (0x1UL << 2)                       /**< CTS Function Enabled */
#define _UART_CTRLX_CTSEN_SHIFT                2                                  /**< Shift value for USART_CTSEN */
#define _UART_CTRLX_CTSEN_MASK                 0x4UL                              /**< Bit mask for USART_CTSEN */
#define _UART_CTRLX_CTSEN_DEFAULT              0x00000000UL                       /**< Mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_CTSEN_DEFAULT               (_UART_CTRLX_CTSEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_RTSINV                      (0x1UL << 3)                       /**< RTS Pin Inversion */
#define _UART_CTRLX_RTSINV_SHIFT               3                                  /**< Shift value for USART_RTSINV */
#define _UART_CTRLX_RTSINV_MASK                0x8UL                              /**< Bit mask for USART_RTSINV */
#define _UART_CTRLX_RTSINV_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for UART_CTRLX */
#define UART_CTRLX_RTSINV_DEFAULT              (_UART_CTRLX_RTSINV_DEFAULT << 3)  /**< Shifted mode DEFAULT for UART_CTRLX */

/* Bit fields for UART TIMECMP0 */
#define _UART_TIMECMP0_RESETVALUE              0x00000000UL                             /**< Default value for UART_TIMECMP0 */
#define _UART_TIMECMP0_MASK                    0x017700FFUL                             /**< Mask for UART_TIMECMP0 */
#define _UART_TIMECMP0_TCMPVAL_SHIFT           0                                        /**< Shift value for USART_TCMPVAL */
#define _UART_TIMECMP0_TCMPVAL_MASK            0xFFUL                                   /**< Bit mask for USART_TCMPVAL */
#define _UART_TIMECMP0_TCMPVAL_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP0 */
#define UART_TIMECMP0_TCMPVAL_DEFAULT          (_UART_TIMECMP0_TCMPVAL_DEFAULT << 0)    /**< Shifted mode DEFAULT for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTART_SHIFT            16                                       /**< Shift value for USART_TSTART */
#define _UART_TIMECMP0_TSTART_MASK             0x70000UL                                /**< Bit mask for USART_TSTART */
#define _UART_TIMECMP0_TSTART_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTART_DISABLE          0x00000000UL                             /**< Mode DISABLE for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTART_TXEOF            0x00000001UL                             /**< Mode TXEOF for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTART_TXC              0x00000002UL                             /**< Mode TXC for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTART_RXACT            0x00000003UL                             /**< Mode RXACT for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTART_RXEOF            0x00000004UL                             /**< Mode RXEOF for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTART_DEFAULT           (_UART_TIMECMP0_TSTART_DEFAULT << 16)    /**< Shifted mode DEFAULT for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTART_DISABLE           (_UART_TIMECMP0_TSTART_DISABLE << 16)    /**< Shifted mode DISABLE for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTART_TXEOF             (_UART_TIMECMP0_TSTART_TXEOF << 16)      /**< Shifted mode TXEOF for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTART_TXC               (_UART_TIMECMP0_TSTART_TXC << 16)        /**< Shifted mode TXC for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTART_RXACT             (_UART_TIMECMP0_TSTART_RXACT << 16)      /**< Shifted mode RXACT for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTART_RXEOF             (_UART_TIMECMP0_TSTART_RXEOF << 16)      /**< Shifted mode RXEOF for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTOP_SHIFT             20                                       /**< Shift value for USART_TSTOP */
#define _UART_TIMECMP0_TSTOP_MASK              0x700000UL                               /**< Bit mask for USART_TSTOP */
#define _UART_TIMECMP0_TSTOP_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTOP_TCMP0             0x00000000UL                             /**< Mode TCMP0 for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTOP_TXST              0x00000001UL                             /**< Mode TXST for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTOP_RXACT             0x00000002UL                             /**< Mode RXACT for UART_TIMECMP0 */
#define _UART_TIMECMP0_TSTOP_RXACTN            0x00000003UL                             /**< Mode RXACTN for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTOP_DEFAULT            (_UART_TIMECMP0_TSTOP_DEFAULT << 20)     /**< Shifted mode DEFAULT for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTOP_TCMP0              (_UART_TIMECMP0_TSTOP_TCMP0 << 20)       /**< Shifted mode TCMP0 for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTOP_TXST               (_UART_TIMECMP0_TSTOP_TXST << 20)        /**< Shifted mode TXST for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTOP_RXACT              (_UART_TIMECMP0_TSTOP_RXACT << 20)       /**< Shifted mode RXACT for UART_TIMECMP0 */
#define UART_TIMECMP0_TSTOP_RXACTN             (_UART_TIMECMP0_TSTOP_RXACTN << 20)      /**< Shifted mode RXACTN for UART_TIMECMP0 */
#define UART_TIMECMP0_RESTARTEN                (0x1UL << 24)                            /**< Restart Timer on TCMP0 */
#define _UART_TIMECMP0_RESTARTEN_SHIFT         24                                       /**< Shift value for USART_RESTARTEN */
#define _UART_TIMECMP0_RESTARTEN_MASK          0x1000000UL                              /**< Bit mask for USART_RESTARTEN */
#define _UART_TIMECMP0_RESTARTEN_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP0 */
#define UART_TIMECMP0_RESTARTEN_DEFAULT        (_UART_TIMECMP0_RESTARTEN_DEFAULT << 24) /**< Shifted mode DEFAULT for UART_TIMECMP0 */

